In [2]:
import os
import dotenv

dotenv.load_dotenv()

True

In [3]:
db_user = os.environ.get('DB_USER')
db_password = os.environ.get('DB_PASSWORD')

from sqlalchemy import create_engine

engine = create_engine('postgresql://'+db_user+':'+db_password+'@localhost:5432/green_taxi', echo=False)

In [4]:
engine.connect()

In [10]:
import pandas as pd
pd.read_sql_query('select (select count(1) from public.green_taxi_data where trip_distance <= 1),(select count(1) from public.green_taxi_data where trip_distance > 1 and trip_distance <= 3),(select count(1) from public.green_taxi_data where trip_distance > 3 and trip_distance <= 7),(select count(1) from public.green_taxi_data where trip_distance > 7 and trip_distance <= 10),(select count(1) from public.green_taxi_data where trip_distance > 10)', con=engine)

    count   count   count  count  count
0  104838  199013  109645  27688  35202

In [12]:
import pandas as pd

pd.read_sql_query('select td.lpep_pickup_datetime FROM public.green_taxi_data td order by trip_distance desc limit 1', con=engine)

  lpep_pickup_datetime
0  2019-10-31 23:23:41

In [13]:
import pandas as pd

pd.read_sql_query('select zns."Zone" from public.green_taxi_data td inner join public.zones zns on zns."LocationID" = td."PULocationID" group by zns."LocationID", zns."Zone" having count(1) > 13000', con=engine)

                   Zone
0               Astoria
1        Central Harlem
2  Central Harlem North
3     East Harlem North
4     East Harlem South
5              Elmhurst
6          Forest Hills
7   Morningside Heights

In [14]:
import pandas as pd

pd.read_sql_query('select z."Zone", z."Borough"  FROM public.green_taxi_data td inner join zones z on z."LocationID" = td."DOLocationID" where td."PULocationID" = (select zones."LocationID" from zones where zones."Zone" = \'East Harlem North\') order by tip_amount desc limit 1', con=engine)

          Zone Borough
0  JFK Airport  Queens